{
  "portfolio": [
    {
      "name": "Ark Server Dashboard",
      "startDate": "2016-02-01",
      "endDate": "2016-02-27",
      "vcsUrl": "https://github.com/jenniferplusplus/ark-dashboard",
      "vcsName": "Github",
      "demoUrl": "http://toolboxgaming.com/ark",
      "desc": "A web UI which presents some basic information about a game server which implements the steam server protocol, and enables the server to be started on demand by non-admin players. This was my first experience with Express, which was generally pleasant to work with. The app is basically functional at this point, but could benefit from some UX enhancements like progress/loading indicators.",
      "tech": "Built using Node.js and Express.js to run the application logic. It can run as a self-contained web app. Or, it can instead be configured to generate static content which is suitable to be served by a high performance dedicated web server such as Nginx. Nginx then proxies only the REST endpoints to Express. The app also makes use of the Q.js promise library to simplify asynchronous network and system calls; and uses session keys to enable digest-like hashing to protect passwords in transit and prevent replay attacks on the API, although HTTPS would be recommended as more secure.",
      "pictures": [
        {
          "desc": "Node.js",
          "url": "https://nodejs.org/static/images/logos/nodejs-new-pantone-black.png"
        }
      ]
    },
    {
      "name": "Require-with",
      "startDate": "2016-06-01",
      "endDate": "2016-06-08",
      "vcsUrl": "https://github.com/jenniferplusplus/require-with",
      "vcsName": "Github",
      "demoUrl": "https://www.npmjs.com/package/require-with",
      "desc": "A drop-in dependency injection module for Node.js. The goal is to remain stylistically similar to the ordinary Node Require method. It is especially well suited for use within tests or to quickly experiment with alternative libraries.",
      "tech": "The project has essentially no dependencies of its own outside of Node.js built-ins. The basic premise is to load files and eval them in a sand-boxed context. Some additional logic goes into intercepting other calls to require(), and to resolving relative paths appropriately.",
      "pictures": [
        {
          "desc": "Node.js",
          "url": "https://nodejs.org/static/images/logos/nodejs-new-pantone-black.png"
        }
      ]
    },
    {
      "name": "Request-as-Promise",
      "startDate": "2016-08-23",
      "endDate": "2016-09-07",
      "vcsUrl": "https://github.com/jenniferplusplus/request-as-promised",
      "vcsName": "Github",
      "demoUrl": "https://www.npmjs.com/package/request-as-promise",
      "desc": "A wrapper for the popular Node.js Request module that converts it to a promise pattern. For scenarios where streaming isn't appropriate, I fell promises are the most sensible pattern for managing most asynchronous processing.",
      "tech": "The promises are created by the excellent Q.js module. The other major project which does this wrapping relies on Bluebird. This provides an alternative for projects where Q is the pre-existing promise library.",
      "pictures": [
        {
          "desc": "Node.js",
          "url": "https://nodejs.org/static/images/logos/nodejs-new-pantone-black.png"
        }
      ]
    }
  ]
}