{
  "basics": {
    "name": "Jennifer Moore",
    "label": "Software Engineer",
    "picture": "",
    "email": "jenniferplusplus@gmail.com",
    "phone": "(817) 264-7347",
    "summary": "I'm an experienced software engineer with a particular focus on quality, testing, and DevOps. I want to grow both personally and as an engineer by working on interesting problems alongside talented people.",
    "location": {
      "address": "2241 Tiffany Glenn Ct",
      "postalCode": "TX 76021",
      "city": "Bedford",
      "countryCode": "US",
      "region": "Texas"
    },
    "website": "https://jenniferplusplus.com",
    "profiles": [{
      "network": "LinkedIn",
      "username": "jenniferpluplus",
      "url": "https://linkedin.com/in/jenniferplusplus"
    }]
  },
  "work": [
    {
      "company": "Allegro Development",
      "position": "Principal Software Engineer",
      "startDate": "2017-11-01",
      "endDate": "2018-09-01",
      "summary": "At Allegro I have lead an overseas team in designing and building new features for Allegro's main product, Horizon. I also have advanced best practices including unit testing and devops.",
      "highlights": [
        "Designed and implemented scripting and automation features in the application. These are used by external clients to ensure data integrity and internally by QA and client services.",
        "Worked primarily with C# and MS SQL Server.",
        "Mentored junior developers on design principles and best practices.",
        "Worked with product managers and development directors to understand product requirements from both internal and external users.",
        "Improved the packaging and deployment process for development builds to remove manual operations and facilitate CI/CD."
      ]
    },
    {
      "company": "Parkhub",
      "position": "Senior Software Engineer",
      "startDate": "2017-03-01",
      "endDate": "2017-09-01",
      "summary": "At Parkhub, I built the next generation of services and infrastructure to allow the company to grow to provide a Global Distribution System for parking inventory and data driven insights for parking operators. I worked with IoT sensors, microservices, and mobile-first offline-first applications.",
      "highlights": [
        "Designed and built a charting API to transform sensor based parking event data into a format that's easily visualized in graphs or charts.",
        "Created a new architecture based on microservices. The architecture is deployed in Docker containers using Kubernetes for orchestration. It uses an event sourced model powered by Kafka, with individual services built primarily in Node.JS.",
        "Worked with backend technologies including Node.JS, C#/.NET Core, GraphQL, Mongo, Postgres, and others",
        "Worked with Javascript frameworks, primarily React, Redux, and RxJS.",
        "Enhanced CI pipelines to be faster and more reliable while producing better metadata and more clear explanations of failures during build, test, and deployment phases.",
        "Worked in a Scrum-like process. Collaborated on requirements gathering and story design. Provided estimates for planned stories. Worked within 2-week sprint cycles.",
        "Promoted a reactive software architecture which reflects the core event stream of the underlying infrastructure."
      ]
    },
    {
      "company": "Fidelity Investments",
      "position": "Senior Software Engineer",
      "startDate": "2014-06-01",
      "endDate": "2017-03-01",
      "summary": "As a software engineer, I've contributed to the design and implementation of several customer facing and middle tier applications. I also worked to promote best practices and mentored junior team members. In this position I've continued to participate in an Agile/Scrum methodology, and I've worked mostly with AngularJS and NodeJS.",
      "highlights": [
        "Designed and implemented multiple projects including a customer facing apps and middleware services; provided ongoing development ans support after release.",
        "Worked with C#, Angular, Angular Reactive Extensions, Node.js, and Express.",
        "Maintained greater than 90% test coverage for these projects.",
        "Worked closely with Product Owner in Scrum process to clarify requirements and adapt them to user stories.",
        "Estimated scope of stories and collaborated with the team to share work and meet sprint goals.",
        "Promoted best practices using functional techniques and MVVM design patterns.",
        "Implemented and maintained the CI/CD pipeline."
      ]
    },
    {
      "company": "Ambit Energy",
      "position": "Software Developer",
      "startDate": "2013-10-01",
      "endDate": "2014-06-01",
      "summary": "During my contract at Ambit I worked on several projects to support back office administrative and development tasks. I built desktop tools to facilitate repetitive work as well as supporting the rest of the development team in building and configuring new build and test tools.",
      "highlights": [
        "Developed and helped design a modular, menu-and-data-driven, automated test utility called Testify.",
        "Developed Testify modules for interacting with Windows UIs, Web UIs, SQL databases, and REST services.",
        "Integrated with TFS for defect tracking and test case management.",
        "Created several utilities to automate common tasks for internal business users."
      ]
    },
    {
      "company": "Think Finance",
      "position": "QA Automation Engineer",
      "startDate": "2012-06-01",
      "endDate": "2013-06-01",
      "summary": "At Think Finance, I implemented an automated testing framework in C# based on the open source tools Fitnesse and Selenium Webdriver.  This framework was used to perform full integration tests of the Think Finance IT SoA platform, as well as E2E functional tests of the line of business applications it supports.",
      "highlights": [
        "Implemented the UI and database access components of the test framework using Selenium Webdriver and MS Entity Framework.",
        "Served as SME for QA teams regarding the automated test framework.",
        "Shortened test cycles by developing and documenting standards and practices for writing test cases and defects.",
        "Implemented a full automated functional regression test suite for a loan application processing application."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Texas at Arlington",
      "area": "Software Engineering",
      "studyType": "Bachelor of Science",
      "endDate": "2010-05-01",
      "gpa": "3.2"
    }
  ],
  "skills": [
    {
      "name": "Software Development",
      "level": "Expert",
      "keywords": [
        "C#",
        ".Net",
        "Javascript",
        "Node.js",
        "SQL",
        "Regular Expressions",
        "Docker",
        "Kubernetes",
        "Apache Kafka",
        "React",
        "ReactiveX",
        "TDD/BDD"
      ]
    },
    {
      "name": "DevOps",
      "level": "Expert",
      "keywords": [
        "Continuous Integration",
        "Jenkins",
        "Git",
        "Subversion",
        "Amazon Web Services"
      ]
    },
    {
      "name": "SDLC",
      "level": "Expert",
      "keywords": [
        "TFS",
        "Atlassian Jira",
        "Test Case Management",
        "Agile",
        "Scrum",
        "Kanban",
        "Pivotal Tracker"
      ]
    }
  ]
}
